from typing import Dict
import random
from time import time



class HePaiCheck:
    def __init__(self):
        # 存储排斥的番种
        self.repel_model_dict:Dict[int,list] ={
            "dasixi":["pengpenghe","quanfengke","mengfengke","yaojiuke"],"dasanyuan":["yaojiuke"], # 大四喜 大三元
            "lvyise":["hunyise"],"sigang":["pengpenghe","dandiaojiang"], # 绿一色 四杠子
            "jiulianbaodeng_dianhe":["qingyise","wuzi"],"jiulianbaodeng_zimo":["qingyise","wuzi","buqiuren"], # 九莲宝灯 点和/自摸
            "lianqidui_dianhe":["qidui","qingyise","wuzi","mengqianqing"],"lianqidui_zimo":["qidui","qingyise","wuzi","buqiuren"], # 连七对 点和/自摸
            "shisanyao_dianhe":["hunyaojiu","wumengqi","mengqianqing"],"shisanyao_zimo":["hunyaojiu","wumengqi","buqiuren"], # 十三幺 点和/自摸
            "qingyaojiu":["pengpenghe","quandaiyao","shuangtongke","yaojiuke","wuzi"],"xiaosixi":["sanfengke","yaojiuke"], # 清幺九 小四喜
            "xiaosanyuan":["shuangjianke","yaojiuke"],"ziyise":["pengpenghe","quandaiyao","yaojiuke"], # 小三元 字一色
            "sianke_dianhe":["pengpenghe","mengqianqing"],"sianke_zimo":["pengpenghe","buqiuren"], # 四暗刻 点和/自摸
            "yiseshuanglonghui":["qingyise","pinghe","wuzi"], "yisesitongshun":["siguiyi"], # 一色双龙会 一色四同顺
            "yisesijiegao":["pengpenghe"],"yisesibugao":[],"sangang":[], # 一色四节高 一色四步高 三杠
            "hunyaojiu":["pengpenghe","quandaiyao","yaojiuke"], # 混幺九
            "qidui_dianhe":["mengqianqing"],"qidui_zimo":["buqiuren"], # 七对 点和/自摸
            "qixingbukao_dianhe":["quanbukao","wumengqi","mengqianqing"],"qixingbukao_zimo":["quanbukao","wumengqi","buqiuren"], # 七星不靠 全不靠
            "quanshuangke":["pengpenghe","duanyao","wuzi"], # 全双刻
            "qingyise":["wuzi"],"yisesantongshun":[],"yisesanjiegao":[], # 一色四顺 一色四节高
            "quanda":["dayuwu","wuzi"],"quanzhong":["duanyao","wuzi"],"quanxiao":["xiaoyuwu","wuzi"], # 全大 全中 全小
            "qinglong":[],"sanseshuanglonghui":["pinghe","wuzi"],"yisesanbugao":[], # 清龙 三色双龙会 一色三步高
            "quandaiwu":["duanyao","wuzi"],"santongke":[],"sananke":[], # 全带五 三同刻 三暗刻
            "quanbukao_dianhe":["mengqianqing"],"quanbukao_zimo":["buqiuren"], # 全不靠 点和/自摸
            "zuhelong":[],"dayuwu":["wuzi"],"xiaoyuwu":["wuzi"],"sanfengke":[], # 组合龙 大于五 小于五 三风刻
            "hualong":[],"tuibudao":["queyimeng"],"sansesantongshun":[],"sansesanjiegao":[], # 花龙 推不倒 三色三同顺 三色三节高
            "wufanhe":[],"miaoshouhuicun":[],"haidilaoyue":[],"gangshangkaihua":["zimo"], # 无番和 妙手回春 海底捞月 杠上开花
            "qiangganghe":["hejuezhang"],"pengpenghe":[],"hunyise":[],"sansesanbugao":[], # 抢杠和 碰碰和 混一色 一色三步高
            "wumengqi":[],"quanqiuren":["dandiaojiang"],"shuangangang":["shuanganke"], # 五门齐 全求人 双暗杠
            "shuangjianke":["yaojiuke"],"quandaiyao":[],"buqiuren":["zimo"], # 双箭刻 全带幺 不求人
            "shuangminggang":[],"hejuezhang":[],"jianke":[],"quanfengke":[], # 双明杠 和绝张 箭刻 全风刻
            "mengfengke":[],"mengqianqing":[],"pinghe":["wuzi"],"siguiyi":[], # 门风刻 门前清 平和 四归一
            "shuangtongke":[],"shuanganke":[],"angang":[],"duanyao":["wuzi"], # 双同刻 双暗刻 暗杠 断幺
            "yibangao":[],"xixiangfeng":[],"lianliu":[],"laoshaofu":[],"yaojiuke":[], # 一般高 喜相逢 连六 老少副 幺九刻
            "minggang":[],"queyimeng":[],"wuzi":[],"bianzhang":[],"qianzhang":[], # 明杠 缺一门 无字 边张 嵌张
            "dandiaojiang":[],"zimo":[],"huapai":[],"mingangang":[], # 单钓将 自摸 花牌 明暗杠
            }
        # 存储番种的番数
        self.count_model_dict:Dict[str,int] = {
            "dasixi":88,"dasanyuan":88,"lvyise":88,"jiulianbaodeng_dianhe":88,"jiulianbaodeng_zimo":88,"sigang":88,
            "lianqidui_dianhe":88,"lianqidui_zimo":88,"shisanyao_dianhe":88,"shisanyao_zimo":88,
            "qingyaojiu":64,"xiaosixi":64,"xiaosanyuan":64,"ziyise":64,"sianke_dianhe":64,"sianke_zimo":64,"yiseshuanglonghui":64,
            "yisesitongshun":48,"yisesijiegao":48,"yisesibugao":32,"sangang":32,"hunyaojiu":32,
            "qidui_dianhe":24,"qidui_zimo":24,"qixingbukao_dianhe":24,"qixingbukao_zimo":24,"quanshuangke":24,
            "qingyise":24,"yisesantongshun":24,"yisesanjiegao":24,"quanda":24,"quanzhong":24,"quanxiao":24,
            "qinglong":16,"sanseshuanglonghui":16,"yisesanbugao":16,"quandaiwu":16,"santongke":16,"sananke":16,"quanbukao_dianhe":12,
            "quanbukao_zimo":12,"zuhelong":12,"dayuwu":12,"xiaoyuwu":12,"sanfengke":12,
            "hualong":8,"tuibudao":8,"sansesantongshun":8,"sansesanjiegao":8,"wufanhe":8,"miaoshouhuicun":8,"haidilaoyue":8,
            "gangshangkaihua":8,"qiangganghe":8,"pengpenghe":6,"hunyise":6,"sansesanbugao":6,"wumengqi":6,"quanqiuren":6,"shuangangang":6,"shuangjianke":6,
            "quandaiyao":4,"buqiuren":4,"shuangminggang":4,"hejuezhang":4,"jianke":2,"quanfengke":2,"mengfengke":2,"mengqianqing":2,
            "pinghe":2,"siguiyi":2,"shuangtongke":2,"shuanganke":2,"angang":2,"duanyao":2,"yibangao":1,"xixiangfeng":1,
            "lianliu":1,"laoshaofu":1,"yaojiuke":1,"minggang":1,"queyimeng":1,"wuzi":1,"bianzhang":1,
            "qianzhang":1,"dandiaojiang":1,"zimo":1,"huapai":1,"mingangang":5,
            }
    def __init__(self):
        self.fan_dict = {}

    def hepai_check(self,hand_list,tiles_combination,way_to_hepai,get_tile):
        pass



























# 测试
if __name__ == "__main__":
    test_hand_list = [[13, 13, 13, 22, 22, 22, 22, 23, 24, 31, 31, 41, 41], [12, 12, 12, 13, 13, 16, 17, 23, 23, 23, 36, 37, 38], [17, 17, 18, 18, 18, 21, 22, 28, 28, 28, 36, 36, 36], [17, 18, 19, 27, 28, 29, 29, 29, 32, 33, 34, 34, 34], [29, 29, 29, 32, 32, 33, 33, 34, 37, 37, 43, 43, 43], [14, 15, 16, 21, 23, 31, 32, 32, 33, 33, 34, 34, 34], [13, 13, 13, 23, 23, 25, 26, 27, 43, 43, 43, 43, 43], [22, 22, 26, 27, 27, 28, 29, 35, 35, 35, 38, 38, 38], [22, 23, 24, 33, 33, 33, 36, 36, 36, 42, 45, 45, 45], [24, 24, 24, 27, 28, 29, 35, 37, 37, 37, 41, 41, 41], [12, 12, 12, 13, 13, 14, 15, 15, 15, 16, 17, 19, 19], [11, 12, 13, 13, 13, 13, 21, 23, 31, 31, 31, 46, 46], [14, 16, 17, 18, 19, 22, 22, 22, 41, 41, 41, 42, 42], [12, 12, 12, 23, 23, 23, 27, 29, 31, 31, 33, 33, 33], [16, 16, 23, 24, 24, 25, 25, 26, 27, 27, 35, 35, 35], [19, 19, 21, 22, 23, 24, 24, 34, 34, 34, 43, 43, 43], [14, 14, 14, 14, 14, 14, 21, 32, 33, 33, 33, 33, 34], [13, 13, 25, 25, 25, 27, 27, 27, 33, 34, 35, 42, 42], [13, 13, 24, 24, 24, 24, 24, 24, 26, 27, 28, 47, 47], [17, 18, 19, 33, 34, 34, 34, 36, 37, 38, 46, 46, 46], [15, 15, 15, 15, 17, 29, 29, 29, 31, 32, 33, 39, 39], [14, 14, 14, 21, 21, 28, 28, 35, 35, 35, 38, 38, 38], [11, 11, 11, 13, 13, 15, 15, 15, 21, 22, 36, 37, 38], [12, 12, 12, 12, 12, 16, 16, 19, 19, 19, 26, 26, 26], [18, 18, 18, 28, 28, 28, 29, 29, 29, 31, 31, 31, 31], [14, 14, 
14, 14, 14, 22, 22, 22, 26, 26, 39, 39, 39], [15, 15, 34, 34, 34, 35, 36, 37, 38, 38, 38, 41, 41], [15, 15, 15, 18, 18, 18, 22, 22, 22, 35, 36, 36, 36], [11, 11, 21, 22, 
23, 24, 24, 26, 26, 26, 27, 27, 27], [12, 12, 12, 12, 12, 12, 31, 32, 33, 33, 34, 34, 35], [12, 12, 12, 15, 17, 17, 18, 19, 23, 23, 23, 27, 27], [24, 24, 24, 26, 27, 28, 
29, 29, 42, 42, 47, 47, 47], [13, 13, 13, 27, 27, 29, 29, 29, 41, 41, 45, 45, 45], [11, 11, 33, 33, 33, 34, 35, 36, 36, 36, 43, 43, 43], [28, 28, 31, 32, 33, 33, 33, 33, 
35, 36, 37, 37, 37], [14, 15, 16, 22, 23, 24, 38, 38, 39, 39, 42, 42, 42], [12, 12, 12, 18, 18, 18, 23, 23, 24, 24, 25, 25, 29], [13, 13, 13, 21, 21, 22, 22, 31, 32, 33, 
37, 38, 39], [24, 24, 24, 27, 27, 36, 36, 36, 39, 39, 39, 39, 39], [23, 23, 27, 27, 27, 34, 35, 36, 42, 42, 43, 43, 43], [12, 13, 14, 18, 18, 18, 38, 38, 38, 38, 43, 43, 
43], [11, 11, 11, 31, 31, 35, 35, 36, 37, 37, 45, 45, 45], [12, 13, 19, 19, 19, 26, 26, 26, 44, 44, 44, 45, 45], [29, 29, 29, 41, 41, 41, 41, 41, 41, 41, 41, 47, 47], [12, 13, 13, 14, 14, 15, 22, 23, 24, 25, 26, 27, 27], [23, 24, 25, 25, 25, 26, 26, 26, 31, 31, 39, 39, 39], [12, 12, 12, 15, 16, 19, 19, 25, 26, 27, 41, 41, 41], [15, 15, 15, 21, 22, 23, 24, 26, 33, 33, 33, 47, 47], [18, 18, 25, 25, 32, 33, 34, 34, 34, 34, 37, 38, 39], [12, 12, 25, 26, 27, 32, 32, 33, 33, 33, 42, 42, 42], [12, 13, 14, 21, 21, 21, 23, 25, 28, 28, 47, 47, 47], [13, 14, 15, 36, 36, 36, 41, 41, 41, 43, 43, 44, 44], [12, 12, 12, 14, 15, 16, 18, 18, 31, 31, 31, 32, 33], [15, 15, 29, 29, 29, 33, 33, 33, 37, 37, 37, 42, 42], [16, 16, 16, 22, 22, 22, 35, 36, 37, 41, 41, 47, 47], [16, 17, 18, 23, 23, 23, 34, 34, 38, 38, 42, 42, 42], [11, 12, 13, 16, 18, 28, 28, 28, 32, 33, 34, 38, 38], [14, 14, 29, 29, 29, 34, 34, 34, 34, 35, 36, 41, 41], [22, 22, 22, 25, 25, 28, 28, 28, 31, 31, 46, 46, 46], [11, 11, 11, 15, 16, 16, 16, 16, 17, 17, 17, 47, 47], [12, 13, 21, 21, 21, 37, 38, 38, 38, 38, 39, 44, 44], [16, 16, 16, 17, 17, 17, 17, 17, 27, 28, 29, 34, 34], [29, 29, 29, 33, 33, 33, 38, 39, 42, 42, 42, 46, 46], [14, 14, 14, 15, 16, 17, 37, 37, 37, 41, 41, 43, 43], [17, 17, 35, 35, 35, 37, 37, 43, 43, 43, 47, 47, 47], [12, 12, 24, 25, 26, 33, 33, 37, 38, 39, 45, 45, 45], [14, 
15, 16, 28, 28, 29, 29, 29, 33, 33, 33, 37, 38], [14, 15, 15, 15, 16, 25, 26, 27, 27, 27, 37, 38, 39], [13, 13, 17, 17, 17, 25, 25, 28, 28, 28, 41, 41, 41], [17, 18, 18, 
19, 19, 25, 25, 25, 26, 27, 28, 45, 45], [16, 16, 22, 23, 23, 24, 25, 26, 26, 26, 26, 27, 28], [11, 11, 11, 11, 11, 15, 16, 17, 36, 36, 36, 43, 43], [12, 13, 14, 14, 15, 
16, 32, 32, 32, 45, 46, 46, 46], [15, 15, 15, 27, 28, 29, 34, 35, 36, 36, 45, 45, 45], [12, 12, 12, 17, 17, 19, 19, 24, 25, 26, 35, 35, 35], [11, 11, 11, 22, 23, 24, 29, 
29, 38, 39, 47, 47, 47], [13, 14, 15, 21, 21, 21, 23, 23, 23, 36, 36, 36, 37], [16, 16, 18, 18, 18, 25, 26, 27, 31, 32, 32, 32, 33], [19, 19, 19, 33, 34, 34, 34, 34, 41, 
41, 47, 47, 47], [15, 15, 23, 23, 23, 25, 26, 27, 34, 34, 37, 38, 39], [17, 18, 18, 18, 18, 19, 37, 39, 39, 39, 45, 45, 45], [16, 16, 16, 17, 18, 19, 19, 19, 25, 25, 25, 
32, 32], [12, 13, 14, 15, 16, 16, 16, 17, 22, 23, 42, 42, 42], [25, 26, 27, 29, 29, 29, 38, 38, 42, 42, 42, 44, 44], [13, 14, 15, 17, 19, 28, 28, 28, 34, 34, 34, 39, 39], [15, 16, 17, 25, 25, 25, 35, 35, 35, 36, 36, 47, 47], [13, 14, 15, 17, 19, 28, 28, 28, 33, 33, 37, 38, 39], [19, 19, 19, 19, 19, 33, 34, 35, 44, 44, 47, 47, 47], [16, 16, 22, 23, 24, 25, 25, 25, 37, 38, 39, 44, 44], [16, 16, 24, 24, 24, 26, 28, 34, 34, 34, 35, 35, 35], [26, 27, 31, 31, 33, 33, 33, 35, 35, 36, 36, 37, 37], [21, 21, 21, 21, 21, 25, 25, 35, 36, 37, 41, 41, 41], [16, 17, 18, 21, 22, 23, 31, 31, 32, 32, 37, 38, 39], [13, 14, 19, 19, 19, 22, 22, 22, 25, 25, 34, 34, 34], [13, 13, 13, 17, 17, 18, 19, 19, 21, 21, 27, 27, 27], [12, 12, 12, 25, 25, 25, 27, 28, 38, 38, 43, 43, 43], [14, 14, 21, 21, 21, 25, 25, 25, 44, 44, 47, 47, 47], [18, 18, 18, 25, 25, 28, 28, 33, 33, 33, 34, 35, 36], [16, 17, 18, 24, 25, 26, 27, 29, 32, 33, 34, 41, 41], [11, 11, 11, 28, 28, 28, 33, 33, 33, 37, 37, 39, 39]]
    test_waiting_list = [{'一般型': [41, 31]}, {'一般型': [18, 15]}, {'一般型': [20, 23]}, {'一般型': [26, 34, 29, 31]}, {'一般型': [34, 31]}, {'一般型': [22]}, {'一般型': [43, 23]}, {'一般型': 
[25, 28]}, {'一般型': [42]}, {'一般型': [35, 36]}, {'全不靠': [11, 41, 42, 43, 44, 45, 46, 47], '一般型': [14]}, {'一般型': [22]}, {'一般型': [15]}, {'一般型': [28]}, 
{'一般型': [16, 27]}, {'一般型': [24, 19]}, {'一般型': [21]}, {'一般型': [42, 13]}, {'一般型': [13, 47]}, {'一般型': [32, 33, 35]}, {'一般型': [16]}, {'一般型': [28, 21]}, 
{'一般型': [20, 23]}, {'一般型': [16, 12]}, {'一般型': [30, 31]}, {'一般型': [26, 14]}, {'一般型': [41, 15]}, {'一般型': [34, 35, 37]}, {'一般型': [24, 11]}, {'一般型': [34, 31]},
 {'一般型': [16]}, {'一般型': [42, 29]}, {'一般型': [41, 27]}, {'一般型': [33, 11, 36]}, {'一般型': [34, 28, 37]}, {'一般型': [38, 39]}, {'一般型': [29]},
{'一般型': [21, 22]}, {'全不靠': [41, 42, 43, 44, 45, 46, 47], '一般型': [27, 39]}, {'一般型': [42, 23]}, {'一般型': [38]}, {'一般型': [36]}, {'一般型': [11, 14]},
 {'一般型': [41, 47]}, {'一般型': [24, 27, 21]}, {'一般型': [25, 22, 31]}, {'一般型': [17, 14]}, {'一般型': [25]}, {'一般型': [25, 18]}, {'一般型': [32, 12]}, {'一般型': [24]},
   {'一般型': [43, 44]}, {'一般型': [18, 34, 31]}, {'一般型': [42, 15]}, {'一般型': [41, 47]}, {'一般型': [34, 38]}, {}, {'一般型': [41, 14]}, {'一般型': [25, 31]}, 
{'一般型': [17, 14, 47]}, {'一般型': [11, 14]}, {'一般型': [17, 34]}, {'一般型': [40, 37]}, {'一般型': [41, 43]}, {'一般型': [17, 37]}, {'一般型': [33, 12]}, {'一般型': [36, 39]},
 {'一般型': [24, 27, 15]}, {'一般型': [25, 13]}, {'一般型': [17, 20]}, {'一般型': [24, 21]}, {'一般型': [43, 11]}, {'一般型': [44, 45, 47]}, {'一般型': [33, 36]}, {'一般型': [17, 19]},
 {'一般型': [40, 37]}, {'一般型': [35, 37, 38]}, {'一般型': [16, 32]}, {'一般型': [32, 35]}, {'一般型': [34, 15]}, {'一般型': [37, 38]}, {'一般型': [16, 32, 19]}, {'一般型': [24, 21]},
   {'一般型': [44, 38]}, {'一般型': [18]}, {'一般型': [36, 47]}, {}, {'一般型': [19, 44]}, {'一般型': [16, 44]}, {'一般型': [27]}, {'一般型': [25, 28]}, {'一般型': [25, 21]}, {'一般型': [32, 31]},
     {'一般型': [12, 15]}, {'一般型': [18]}, {'一般型': [26, 29]}, {'一般型': [44, 14]}, {'一般型': [25, 28]}, {}, {'一般型': [37, 39]}]
    test_hepai_type = ["荣和","自摸","岭上开花","抢杠","和绝张"]